modules/agendation/controllers/AgendaController.php

	public function actionGetagenda($start=NULL,$end=NULL,$_=NULL){

		\Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;

		$Agendas = Agenda::find()
		                    ->alias('t')
							->select('t.*, a.*')
							->innerJoin('TBL_PERSONAS p', 'p.PERS_ID = t.PERS_ID')
							->innerJoin('TBL_AFILIADOS a', 'a.PERS_ID = p.PERS_ID')
							->all();
---
SELECT `t`.*, `a`.* FROM `TBL_AGENDA` `t` INNER JOIN `TBL_PERSONAS` `p` ON p.PERS_ID = t.PERS_ID INNER JOIN `TBL_AFILIADOS` `a` ON a.PERS_ID = p.PERS_ID

	public function actionGetafiliado($id)
	{

		$Personas = Personas::find()
		                    ->alias('t')
							->select('t.*')
							->where(['t.PERS_ID' => $id])
							->one();
---
SELECT `t`.* FROM `TBL_PERSONAS` `t` WHERE `t`.`PERS_ID`='32'