modules/informes/models/Informes.php

SELECT `t`.* FROM `TBL_PAGOS` `t` WHERE `t`.`PAGO_FECHA` <= '2018-10-31' ORDER BY `t`.`PAGO_FECHA`
---
	public function reportevencidos($params)
    {
        $Pagos = Pagos::find()
					->alias('t')
					->select('t.*')
					->andWhere(['<=','t.PAGO_FECHA',$params->INFO_FECHA])
					->orderBy(['t.PAGO_FECHA'=>SORT_ASC])
					->all();