modules/afiliaciones/controllers/AfiliadosController.php

	public function actionSearchdata()
	{

		$identificacion = $_POST['Personas']['PERS_IDENTIFICACION'];

		$Titulares = Personas::find()
		                    ->alias('t')
							->select('t.*')
							->where(['t.PERS_IDENTIFICACION' => $identificacion])
							->innerJoin('TBL_AFILIADOS a', 'a.PERS_ID = t.PERS_ID')
							->one();

		$Beneficiarios = Personas::find()
						    ->alias('t')
							->select('t.*, a.PERS_ID')
							->where(['t.PERS_IDENTIFICACION' => $identificacion])
							->innerJoin('TBL_BENEFICIARIOS b', 't.PERS_ID = b.PERS_ID')
							->innerJoin('TBL_AFILIADOS a', 'b.AFIL_ID = a.AFIL_ID')
							->one();

		if($Titulares){
			$model = Afiliados::find()->alias('t')->select('t.*')->where(['t.PERS_ID' => $Titulares->PERS_ID])->one();
---
SELECT `t`.* FROM `TBL_PERSONAS` `t` INNER JOIN `TBL_AFILIADOS` `a` ON a.PERS_ID = t.PERS_ID WHERE `t`.`PERS_IDENTIFICACION`='40637721'
SELECT `t`.*, `a`.`PERS_ID` FROM `TBL_PERSONAS` `t` INNER JOIN `TBL_BENEFICIARIOS` `b` ON t.PERS_ID = b.PERS_ID INNER JOIN `TBL_AFILIADOS` `a` ON b.AFIL_ID = a.AFIL_ID WHERE `t`.`PERS_IDENTIFICACION`='40637721'
SELECT `t`.* FROM `TBL_AFILIADOS` `t` WHERE `t`.`PERS_ID`=32

						);
			echo json_encode($array);
		}else if($Beneficiarios){
			$model = Afiliados::find()->alias('t')->select('t.*')->where(['t.PERS_ID' => $Beneficiarios->PERS_ID])->one();
---
SELECT `t`.* FROM `TBL_AFILIADOS` `t` WHERE `t`.`PERS_ID`=32

	public function actionUpdateajax()
    {
        $model = $this->findModel($_POST['Afiliados']['AFIL_ID']);
        $Personas = Personas::findOne($model->PERS_ID);

        if ($Personas->load(Yii::$app->request->post())){
			if($Personas->save()){
				if ($model->load(Yii::$app->request->post())){
---
SELECT `t`.* FROM `TBL_AFILIADOS` `t` WHERE `t`.`PERS_ID`=32