modules/agendation/views/agenda/index.php

													<div class="form-group">
														<label for="agenda-est_id">Estado: <span class="danger">*</span></label>
														<?php
														$Estadoscitas=Estadoscitas::find()->all();
---
SELECT * FROM `TBL_ESTADOSCITAS`