modules/configuration/views/empleados/_update.php

SELECT * FROM `TBL_TIPOSIDENTIFICACIONES`
---
					<div class="col-md-6">
						<div class="form-group">
							<?php
							$Tiposidentificaciones=Tiposidentificaciones::find()->all();

SELECT * FROM `TBL_ESTADOSCIVILES`
---
					<div class="col-md-4">
						<div class="form-group">
							<?php
							$Estadosciviles=Estadosciviles::find()->all();

SELECT * FROM `TBL_ESTRACTOS`
---
					<div class="col-md-4">
						<div class="form-group">
							<?php
							$Estractos=Estractos::find()->all();

SELECT * FROM `TBL_ZONAS`
---
					<div class="col-md-4">
						<div class="form-group">
							<?php
							$Zonas=Zonas::find()->all();

SELECT * FROM `TBL_EPSS`
---
					<div class="col-md-6">
						<div class="form-group">
							<?php
							$Epss=Epss::find()->all();

SELECT * FROM `TBL_CARGOS`
---
					<div class="col-md-6">
						<div class="form-group">
							<?php
							$Cargos=Cargos::find()->all();