modules/configuration/controllers/EmpleadosController.php

SELECT `t`.* FROM `TBL_PERSONAS` `t` INNER JOIN `TBL_AFILIADOS` `a` ON a.PERS_ID = t.PERS_ID WHERE `t`.`PERS_IDENTIFICACION`='1'
SELECT `t`.* FROM `TBL_PERSONAS` `t` WHERE `t`.`PERS_IDENTIFICACION`='1'
---
	public function actionSearch()
	{
		$identificacion = $_POST['Personas']['PERS_IDENTIFICACION'];
		$model = Personascreate::find()
		                    ->alias('t')
							->select('t.*')
							->where(['t.PERS_IDENTIFICACION' => $identificacion])
							->innerJoin('TBL_AFILIADOS a', 'a.PERS_ID = t.PERS_ID')
							->one();
		if($model){
		    $array = NULL;
			$array = array(
							'info'=>'true',
							'PERS_IDENTIFICACION'=>$identificacion,
						   );
			echo json_encode($array);
		}else{
			$Personascreate = Personascreate::find()
		                    ->alias('t')
							->select('t.*')
							->where(['t.PERS_IDENTIFICACION' => $identificacion])
							->one();